In [2]:
import pandas as pd
df=pd.read_csv('task.csv')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [3]:
#5 Convert age to numeric and replace invalid values (negative or >100) with NaN
import numpy as np
df['age']=pd.to_numeric(df['age'],errors='coerce')
df.loc[(df['age']<0) | (df['age']>100),'age']=np.nan
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,NaN,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [4]:
#6  Clean salary by removing currency symbols and converting it to numeric.
df["salary"]=(
    df["salary"]
    .astype(str)
    .str.replace("₹","",regex=False)
    .replace("N/A",np.nan)
)
df["salary"]=pd.to_numeric(df["salary"],errors="coerce")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,NaN,50000.00,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000.00,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000.00,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,NaN,25000.00,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000.00,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000.00,HR,2022-01-15,Hyderabad,excellent,five,no

In [5]:
# 7 convert join_data into datetime format handling multiple data formats
df["join_date"]=pd.to_datetime(df["join_date"],format="%m-%d-%y",errors="coerce",dayfirst=True)
# join date=02/03/2025
df['joining_year']=df['join_date'].dt.year
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.00,HR,NaT,DELHI,3,five,True,NaN
1,U1001,30.0,45000.00,Finance,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

In [15]:
#8. extract joining_year from the cleaned joint_date
df = df.copy()
df.loc[:, "joining_year"] = df["join_date"].dt.year
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.0,HR,NaT,Delhi,NaN,5.0,True,NaN
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,NaN,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,1.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,True,NaN
5,user_5,NaN,25000.0,IT,NaT,NaN,NaN,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,user_997,NaN,25000.0,HR,NaT,Mumbai,NaN,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,NaN,0.0,True,NaN

In [7]:
#9 standardize department values by trimming spaces and converting to
df['department']=(
    df["department"]
    .str.strip()
    .str.upper()
)
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.00,HR,NaT,DELHI,3,five,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

In [8]:
# 10 Normalize city names to a consistent case and spelling
df['city']=df['city'].str.strip().str.title()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.00,HR,NaT,Delhi,3,five,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,Delhi,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

In [9]:
# 11 convert performance score into numeric by mapping text values to numbers
performance_map={'poor':0,'excellent':1}
df['performance_score']=df['performance_score'].map(performance_map)
df['performance_score']=pd.to_numeric(df['performance_score'],errors='coerce')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.00,HR,NaT,Delhi,NaN,five,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,NaN,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,1.0,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,Delhi,NaN,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,NaN,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,NaN,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,1.0,five,no,NaN

In [10]:
# 12 clean exprience_years by converting text values to numeric and removing negatives
df['experience_years']=df['experience_years'].replace("five",5)
df['experience_years']=pd.to_numeric(df['experience_years'],errors='coerce')
df.loc[df["experience_years"]<0,"experience_years"]=np.nan
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.00,HR,NaT,Delhi,NaN,5.0,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,NaN,1.0,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,1.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,NaN,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,Delhi,NaN,5.0,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,NaN,5.0,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,NaN,0.0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,1.0,5.0,no,NaN

In [11]:
#13 convert is active values(yes/no/True/False) into boolean format
map={'yes':True,'no':False,'True':True,'False':False}
df['is_active']=df['is_active'].map((map))
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.00,HR,NaT,Delhi,NaN,5.0,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,NaN,1.0,True,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,1.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,True,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,NaN,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,Delhi,NaN,5.0,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,NaN,5.0,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,NaN,0.0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,1.0,5.0,False,NaN

In [12]:
#14 identify and remove duplicate records based on user_id
df=df.drop_duplicates(subset="user_id")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,50000.0,HR,NaT,Delhi,NaN,5.0,True,NaN
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,NaN,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,1.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,True,NaN
5,user_5,NaN,25000.0,IT,NaT,NaN,NaN,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,user_997,NaN,25000.0,HR,NaT,Mumbai,NaN,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,NaN,0.0,True,NaN

In [16]:
#15 Create a clean final DataFrame containing only valid, standardized records
final_df = df.dropna(subset=["user_id", "age", "salary", "join_date"])

print("\nFinal Clean DataFrame Shape:", final_df.shape)
final_df.head()

Final Clean DataFrame Shape: (0, 10)

Empty DataFrame
Columns: [user_id, age, salary, department, join_date, city, performance_score, experience_years, is_active, joining_year]
Index: []